// Встановіть Webpack локально собі у проєкт. Налаштуйте всі параметри для компіляції готового файлу main.js до верхньої директорії final. Встановіть для Webpack завантажувальний сервер з портом 8800.
// Самостійна діяльність учня
// Завдання 1
// Вивчити основні поняття, розглянуті на уроці.

// Завдання 2
// Використовуючи імпорти Typescript, створіть наступну програму з 2 уроку (з абстрактними класами):
// • Перший файл - визначені інтерфейси для опису.
// • Другий файл – класи (батьківський та похідні).
// • Третій файл - екземпляри класів, побудовані на шаблонах інтерфейсів.
// Використовуйте будь-який завантажувач модулів.